// 1
// создайте переменную и присвойте ей числовое значение
// если число положительное, выведите в консоль сообщение "Положительное"
// если число отрицательное, выведите в консоль сообщение "Отрицательное"


let arr = 7; // Пример числового значения

if (arr > 0) {
  console.log("Положительное");
} else if (arr < 0) {
  console.log("Отрицательное");
} else {
  console.log("Число равно нулю");
}


// 2
// создайте переменную и присвойте ей числовое значение
// проверте на четность значение переменной и выведите в консоль сообщение "четное" или "нечетное"





// 3]
// создайте переменную
// проверьте на тип данных если значение ровняется объекту то выведите консоль "объект является ссылочным типом данных" иначе выведите консоль "тип {тип переменной} является примитивным типом данных"

